TexasInstruments/f29h85x-sdk/source/driverlib/clb.h
//###########################################################################
//
// FILE:   clb.h
//
// TITLE:  C29x CLB driver.
//
//###########################################################################
// //
//	Copyright: Copyright (C) Texas Instruments Incorporated
//	All rights reserved not granted herein.
//
//  Redistribution and use in source and binary forms, with or without 
//  modification, are permitted provided that the following conditions 
//  are met:
//
//  Redistributions of source code must retain the above copyright 
//  notice, this list of conditions and the following disclaimer.
//
//  Redistributions in binary form must reproduce the above copyright
//  notice, this list of conditions and the following disclaimer in the 
//  documentation and/or other materials provided with the   
//  distribution.
//
//  Neither the name of Texas Instruments Incorporated nor the names of
//  its contributors may be used to endorse or promote products derived
//  from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//

//###########################################################################

#ifndef CLB_H
#define CLB_H

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C"
{
#endif

//*****************************************************************************
//
//! \addtogroup clb_api CLB
//! @{
//
//*****************************************************************************

#include <stdint.h>
#include <stdbool.h>
#include "inc/hw_clb.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "cpu.h"
#include "debug.h"

//*****************************************************************************
//
// Address offsets from LOGICCFG to LOGICCTL and DATAEXCH register memory maps
//
//*****************************************************************************
#define CLB_LOGICCTL                0x0200U
#define CLB_DATAEXCH                0x0300U

//*****************************************************************************
//
// Address offsets for CLB-internal memory space
//
//*****************************************************************************
#define CLB_ADDR_COUNTER_0_LOAD     0x0U
#define CLB_ADDR_COUNTER_1_LOAD     0x1U
#define CLB_ADDR_COUNTER_2_LOAD     0x2U

#define CLB_ADDR_COUNTER_0_MATCH1   0x4U
#define CLB_ADDR_COUNTER_1_MATCH1   0x5U
#define CLB_ADDR_COUNTER_2_MATCH1   0x6U

#define CLB_ADDR_COUNTER_0_MATCH2   0x8U
#define CLB_ADDR_COUNTER_1_MATCH2   0x9U
#define CLB_ADDR_COUNTER_2_MATCH2   0xAU

#define CLB_ADDR_HLC_R0             0xCU
#define CLB_ADDR_HLC_R1             0xDU
#define CLB_ADDR_HLC_R2             0xEU
#define CLB_ADDR_HLC_R3             0xFU

#define CLB_ADDR_HLC_BASE           0x20U
#define CLB_NUM_HLC_INSTR           31U

//*****************************************************************************
//
// PUSH/PULL FIFO size (32-bit registers)
//
//*****************************************************************************
#define CLB_FIFO_SIZE               4U

//*****************************************************************************
//
// Key to enable writes to the CLB registers
//
//*****************************************************************************
#define CLB_LOCK_KEY                0x5A5AU

//*****************************************************************************
//
// Shift and masks needed by the API for Input selection
//
//*****************************************************************************
#define CLB_LCL_MUX_SEL_MISC_INPUT_SEL_M          0x20U
#define CLB_LCL_MUX_SEL_MISC_INPUT_SEL_S          28U
#define CLB_LCL_MUX_SEL_MISC_INPUT_SEL_BITM       (uint32_t)1U

//*****************************************************************************
//
//! Values that can be passed to control the CLB output enable signal. It can
//! be passed to CLB_setOutputMask() as the \e outputMask parameter.
//
//*****************************************************************************
#define CLB_OUTPUT_00 0x00000001U //!< Mask for CLB OUTPUT ENABLE/DISABLE 0
#define CLB_OUTPUT_01 0x00000002U //!< Mask for CLB OUTPUT ENABLE/DISABLE 1
#define CLB_OUTPUT_02 0x00000004U //!< Mask for CLB OUTPUT ENABLE/DISABLE 2
#define CLB_OUTPUT_03 0x00000008U //!< Mask for CLB OUTPUT ENABLE/DISABLE 3
#define CLB_OUTPUT_04 0x00000010U //!< Mask for CLB OUTPUT ENABLE/DISABLE 4
#define CLB_OUTPUT_05 0x00000020U //!< Mask for CLB OUTPUT ENABLE/DISABLE 5
#define CLB_OUTPUT_06 0x00000040U //!< Mask for CLB OUTPUT ENABLE/DISABLE 6
#define CLB_OUTPUT_07 0x00000080U //!< Mask for CLB OUTPUT ENABLE/DISABLE 7
#define CLB_OUTPUT_08 0x00000100U //!< Mask for CLB OUTPUT ENABLE/DISABLE 8
#define CLB_OUTPUT_09 0x00000200U //!< Mask for CLB OUTPUT ENABLE/DISABLE 9
#define CLB_OUTPUT_10 0x00000400U //!< Mask for CLB OUTPUT ENABLE/DISABLE 10
#define CLB_OUTPUT_11 0x00000800U //!< Mask for CLB OUTPUT ENABLE/DISABLE 11
#define CLB_OUTPUT_12 0x00001000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 12
#define CLB_OUTPUT_13 0x00002000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 13
#define CLB_OUTPUT_14 0x00004000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 14
#define CLB_OUTPUT_15 0x00008000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 15
#define CLB_OUTPUT_16 0x00010000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 16
#define CLB_OUTPUT_17 0x00020000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 17
#define CLB_OUTPUT_18 0x00040000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 18
#define CLB_OUTPUT_19 0x00080000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 19
#define CLB_OUTPUT_20 0x00100000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 20
#define CLB_OUTPUT_21 0x00200000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 21
#define CLB_OUTPUT_22 0x00400000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 22
#define CLB_OUTPUT_23 0x00800000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 23
#define CLB_OUTPUT_24 0x01000000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 24
#define CLB_OUTPUT_25 0x02000000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 25
#define CLB_OUTPUT_26 0x04000000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 26
#define CLB_OUTPUT_27 0x08000000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 27
#define CLB_OUTPUT_28 0x10000000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 28
#define CLB_OUTPUT_29 0x20000000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 29
#define CLB_OUTPUT_30 0x40000000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 30
#define CLB_OUTPUT_31 0x80000000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 31

//*****************************************************************************
//
//! Values that can be passed to select CLB input signal
//
//*****************************************************************************
typedef enum
{
    CLB_IN0 = 0,                    //!< Input 0
    CLB_IN1 = 1,                    //!< Input 1
    CLB_IN2 = 2,                    //!< Input 2
    CLB_IN3 = 3,                    //!< Input 3
    CLB_IN4 = 4,                    //!< Input 4
    CLB_IN5 = 5,                    //!< Input 5
    CLB_IN6 = 6,                    //!< Input 6
    CLB_IN7 = 7                     //!< Input 7
} CLB_Inputs;

//*****************************************************************************
//
//! Values that can be passed to select CLB output signal. It can be passed to
//! CLB_configOutputLUT() as the \e outID parameter.
//
//*****************************************************************************
typedef enum
{
    CLB_OUT0 = 0,                   //!< Output 0
    CLB_OUT1 = 1,                   //!< Output 1
    CLB_OUT2 = 2,                   //!< Output 2
    CLB_OUT3 = 3,                   //!< Output 3
    CLB_OUT4 = 4,                   //!< Output 4
    CLB_OUT5 = 5,                   //!< Output 5
    CLB_OUT6 = 6,                   //!< Output 6
    CLB_OUT7 = 7                    //!< Output 7
} CLB_Outputs;

//*****************************************************************************
//
//! Values that can be passed to select CLB AOC signal. It can be passed to
//! CLB_configAOC() as the \e aocID parameter.
//! AOC is the Asynchronous Output Conditioning block.
//
//*****************************************************************************
typedef enum
{
    CLB_AOC0 = 0,                   //!< AOC 0
    CLB_AOC1 = 1,                   //!< AOC 1
    CLB_AOC2 = 2,                   //!< AOC 2
    CLB_AOC3 = 3,                   //!< AOC 3
    CLB_AOC4 = 4,                   //!< AOC 4
    CLB_AOC5 = 5,                   //!< AOC 5
    CLB_AOC6 = 6,                   //!< AOC 6
    CLB_AOC7 = 7                    //!< AOC 7
} CLB_AOCs;

//*****************************************************************************
//
//! Values that can be passed to set/clear CLB SW release signals. It can
//! be passed to CLB_writeSWReleaseControl() as the \e inID parameter.
//
//*****************************************************************************
typedef enum
{
    CLB_SW_RLS_CTRL0 = 0,           //!< SW RLS CTRL 0
    CLB_SW_RLS_CTRL1 = 1,           //!< SW RLS CTRL 1
    CLB_SW_RLS_CTRL2 = 2,           //!< SW RLS CTRL 2
    CLB_SW_RLS_CTRL3 = 3,           //!< SW RLS CTRL 3
    CLB_SW_RLS_CTRL4 = 4,           //!< SW RLS CTRL 4
    CLB_SW_RLS_CTRL5 = 5,           //!< SW RLS CTRL 5
    CLB_SW_RLS_CTRL6 = 6,           //!< SW RLS CTRL 6
    CLB_SW_RLS_CTRL7 = 7            //!< SW RLS CTRL 7
} CLB_SWReleaseCtrl;

//*****************************************************************************
//
//! Values that can be passed to set/clear CLB SW release signals. It can
//! be passed to CLB_writeSWGateControl() as the \e inID parameter.
//
//*****************************************************************************
typedef enum
{
    CLB_SW_GATE_CTRL0 = 0,           //!< SW GATE CTRL 0
    CLB_SW_GATE_CTRL1 = 1,           //!< SW GATE CTRL 1
    CLB_SW_GATE_CTRL2 = 2,           //!< SW GATE CTRL 2
    CLB_SW_GATE_CTRL3 = 3,           //!< SW GATE CTRL 3
    CLB_SW_GATE_CTRL4 = 4,           //!< SW GATE CTRL 4
    CLB_SW_GATE_CTRL5 = 5,           //!< SW GATE CTRL 5
    CLB_SW_GATE_CTRL6 = 6,           //!< SW GATE CTRL 6
    CLB_SW_GATE_CTRL7 = 7            //!< SW GATE CTRL 7
} CLB_SWGateCtrl;

//*****************************************************************************
//
//! Values that can be passed to select CLB counter. It can be passed to
//! CLB_configCounterLoadMatch() as the \e counterID parameter.
//
//*****************************************************************************
typedef enum
{
    CLB_CTR0 = 0,                   //!< Counter 0
    CLB_CTR1 = 1,                   //!< Counter 1
    CLB_CTR2 = 2                    //!< Counter 2
} CLB_Counters;

//*****************************************************************************
//
//! Values that can be passed to CLB_getRegister() as the \e registerID
//! parameter.
//
//*****************************************************************************
typedef enum
{
    CLB_REG_HLC_R0 = CLB_O_DBG_R0,  //!< HLC R0 register
    CLB_REG_HLC_R1 = CLB_O_DBG_R1,  //!< HLC R1 register
    CLB_REG_HLC_R2 = CLB_O_DBG_R2,  //!< HLC R2 register
    CLB_REG_HLC_R3 = CLB_O_DBG_R3,  //!< HLC R3 register
    CLB_REG_CTR_C0 = CLB_O_DBG_C0,  //!< Counter 0 register
    CLB_REG_CTR_C1 = CLB_O_DBG_C1,  //!< Counter 1 register
    CLB_REG_CTR_C2 = CLB_O_DBG_C2   //!< Counter 2 register
} CLB_Register;

//*****************************************************************************
//
//! Values that can be passed to CLB_selectInputFilter() as the \e filterType
//! parameter.
//
//*****************************************************************************
typedef enum
{
    CLB_FILTER_NONE         = 0,    //!< No filtering
    CLB_FILTER_RISING_EDGE  = 1,    //!< Rising edge detect
    CLB_FILTER_FALLING_EDGE = 2,    //!< Falling edge detect
    CLB_FILTER_ANY_EDGE     = 3     //!< Any edge detect
} CLB_FilterType;

//*****************************************************************************
//
//! Values that can be passed to CLB_configGPInputMux() as the \e gpMuxCfg
//! parameter.
//
//*****************************************************************************
typedef enum
{
    CLB_GP_IN_MUX_EXTERNAL  = 0,    //!< Use external input path
    CLB_GP_IN_MUX_GP_REG    = 1     //!< Use CLB_GP_REG bit value as input
} CLB_GPInputMux;

//*****************************************************************************
//
//! Values that can be passed to CLB_configLocalInputMux() as the
//! \e localMuxCfg parameter.
//
//*****************************************************************************
typedef enum
{
	CLB_LOCAL_IN_MUX_GLOBAL_IN		 = 0,	//!Global input mux selection
	CLB_LOCAL_IN_MUX_EPWM_DCAEVT1		 = 1,	//!EPWMx DCAEVT1
	CLB_LOCAL_IN_MUX_EPWM_DCAEVT2		 = 2,	//!EPWMx DCAEVT2
	CLB_LOCAL_IN_MUX_EPWM_DCBEVT1		 = 3,	//!EPWMx DCBEVT1
	CLB_LOCAL_IN_MUX_EPWM_DCBEVT2		 = 4,	//!EPWMx DCBEVT2
	CLB_LOCAL_IN_MUX_EPWM_DCAH		 = 5,	//!EPWMx DCAH
	CLB_LOCAL_IN_MUX_EPWM_DCAL		 = 6,	//!EPWMx DCAL
	CLB_LOCAL_IN_MUX_EPWM_DCBH		 = 7,	//!EPWMx DCBH
	CLB_LOCAL_IN_MUX_EPWM_DCBL		 = 8,	//!EPWMx DCBL
	CLB_LOCAL_IN_MUX_EPWM_OST		 = 9,	//!EPWMx OST
	CLB_LOCAL_IN_MUX_EPWM_CBC		 = 10,	//!EPWMx CBC
	CLB_LOCAL_IN_MUX_ECAP_ECAPIN		 = 11,	//!ECAPx ECAPIN
	CLB_LOCAL_IN_MUX_ECAP_ECAP_OUT		 = 12,	//!ECAPx ECAP_OUT
	CLB_LOCAL_IN_MUX_ECAP_ECAP_OUT_EN		 = 13,	//!ECAPx ECAP_OUT_EN
	CLB_LOCAL_IN_MUX_ECAP_CEVT1		 = 14,	//!ECAPx CEVT1
	CLB_LOCAL_IN_MUX_ECAP_CEVT2		 = 15,	//!ECAPx CEVT2
	CLB_LOCAL_IN_MUX_ECAP_CEVT3		 = 16,	//!ECAPx CEVT3
	CLB_LOCAL_IN_MUX_ECAP_CEVT4		 = 17,	//!ECAPx CEVT4
	CLB_LOCAL_IN_MUX_EQEP_EQEPA		 = 18,	//!EQEPx EQEPA (CLB 1-4)
	CLB_LOCAL_IN_MUX_FSI_DATA_PKT_RCVD		 = 18,	//!FSI_DATA_PKT_RCVD(CLB 5-6)
	CLB_LOCAL_IN_MUX_EQEP_EQEPB		 = 19,	//!EQEPx EQEPB (CLB 1-4)
	CLB_LOCAL_IN_MUX_FSI_ERROR_PKT_RCVD		 = 19,	//!FSI_ERROR_PKT_RCVD(CLB 5-6)
	CLB_LOCAL_IN_MUX_EQEP_EQEPI		 = 20,	//!EQEPx EQEPI (CLB 1-4)
	CLB_LOCAL_IN_MUX_FSI_PING_PKT_RCVD		 = 20,	//!FSI_PING_PKT_RCVD(CLB 5-6)
	CLB_LOCAL_IN_MUX_EQEP_EQEPS		 = 21,	//!EQEPx EQEPS (CLB 1-4)
	CLB_LOCAL_IN_MUX_CPU3_HALT		 = 21,	//!CPU3.HALT (CLB 5-6)
	CLB_LOCAL_IN_MUX_CPU1_TBCLKSYNC		 = 22,	//!CPU1.TBCLKSYNC
	CLB_LOCAL_IN_MUX_CPU3_TBCLKSYNC		 = 23,	//!CPU3.TBCLKSYNC
	CLB_LOCAL_IN_MUX_CPU2_TBCLKSYNC		 = 23,	//!CPU2.TBCLKSYNC
	CLB_LOCAL_IN_MUX_CPU1_HALT		 = 24,	//!CPU1.HALT (CLB 1-2)
	CLB_LOCAL_IN_MUX_SPIPICO_CONTROLLER		 = 25,	//!SPIPICO Controller Output
	CLB_LOCAL_IN_MUX_SPICLK		 = 26,	//!SPI Clock
	CLB_LOCAL_IN_MUX_SPIPICO_PERIPHERAL		 = 27,	//!SPIPICO Peripheral Input
	CLB_LOCAL_IN_MUX_SPIPTE		 = 28,	//!SPI PTE
	CLB_LOCAL_IN_MUX_SPIPOCI_OUT		 = 30,	//!SPIPOCI(OUT)
	CLB_LOCAL_IN_MUX_CLB_PSCLK		 = 31,	//!CLB prescaled clock
	CLB_LOCAL_IN_MUX_EPWM9A		 = 32,	//!EPWM9A (CLB 1-4)
	CLB_LOCAL_IN_MUX_ECAP5_ECAPIN		 = 32,	//!ECAP5 ECAPIN (CLB 5-6)
	CLB_LOCAL_IN_MUX_ECAP6_ECAPIN		 = 32,	//!ECAPx ECAPIN
	CLB_LOCAL_IN_MUX_EPWM9A_OE		 = 33,	//!EPWM9A trip output (CLB 1-4)
	CLB_LOCAL_IN_MUX_ECAP5_ECAP_OUT		 = 33,	//!ECAP5 ECAP_OUT(CLB 5-6)
	CLB_LOCAL_IN_MUX_ECAP6_ECAP_OUT		 = 33,	//!ECAPx ECAP_OUT
	CLB_LOCAL_IN_MUX_EPWM9B		 = 34,	//!EPWM9B (CLB 1-4)
	CLB_LOCAL_IN_MUX_ECAP5_ECAP_OUT_EN		 = 34,	//!ECAP5 ECAP_OUT_EN(CLB 5-6)
	CLB_LOCAL_IN_MUX_ECAP6_ECAP_OUT_EN		 = 34,	//!ECAPx ECAP_OUT_EN
	CLB_LOCAL_IN_MUX_EPWM9B_OE		 = 35,	//!EPWM9B trip output (CLB 1-4)
	CLB_LOCAL_IN_MUX_ECAP5_CEVT1		 = 35,	//!ECAP5 CEVT1 (CLB 5-6)
	CLB_LOCAL_IN_MUX_ECAP6_CEVT1		 = 35,	//!ECAPx CEVT1
	CLB_LOCAL_IN_MUX_EPWM10A		 = 36,	//!EPWM10A (CLB 1-4)
	CLB_LOCAL_IN_MUX_ECAP5_CEVT2		 = 36,	//!ECAP5 CEVT2 (CLB 5-6)
	CLB_LOCAL_IN_MUX_ECAP6_CEVT2		 = 36,	//!ECAPx CEVT2
	CLB_LOCAL_IN_MUX_EPWM10A_OE		 = 37,	//!EPWM10A trip output (CLB 1-4)
	CLB_LOCAL_IN_MUX_ECAP5_CEVT3		 = 37,	//!ECAP5 CEVT3 (CLB 5-6)
	CLB_LOCAL_IN_MUX_ECAP6_CEVT3		 = 37,	//!ECAPx CEVT3
	CLB_LOCAL_IN_MUX_EPWM10B		 = 38,	//!EPWM10B (CLB 1-4)
	CLB_LOCAL_IN_MUX_ECAP5_CEVT4		 = 38,	//!ECAP5 CEVT4 (CLB 5-6)
	CLB_LOCAL_IN_MUX_ECAP6_CEVT4		 = 38,	//!ECAPx CEVT4
	CLB_LOCAL_IN_MUX_EPWM10B_OE		 = 39,	//!EPWM10B trip output (CLB 1-4)
	CLB_LOCAL_IN_MUX_ECAP5_ECAPIN0		 = 39,	//!ECAP5 ECAPIN (CLB 5-6)
	CLB_LOCAL_IN_MUX_ECAP6_ECAPIN0		 = 39,	//!ECAPx ECAPIN
	CLB_LOCAL_IN_MUX_EPWM11A		 = 40,	//!EPWM11A (CLB 1-4)
	CLB_LOCAL_IN_MUX_EQEP5_EQEPA		 = 40,	//!EQEP5 EQEPA (CLB 5)
	CLB_LOCAL_IN_MUX_EQEP6_EQEPA		 = 40,	//!EQEP6 EQEPA (CLB 6)
	CLB_LOCAL_IN_MUX_EPWM11A_OE		 = 41,	//!EPWM11A trip output (CLB 1-4)
	CLB_LOCAL_IN_MUX_EQEP5_EQEPB		 = 41,	//!EQEP5 EQEPB (CLB 5)
	CLB_LOCAL_IN_MUX_EQEP6_EQEPB		 = 41,	//!EQEP6 EQEPB (CLB 6)
	CLB_LOCAL_IN_MUX_EPWM11B		 = 42,	//!EPWM11B (CLB 1-4)
	CLB_LOCAL_IN_MUX_EQEP5_EQEPI		 = 42,	//!EQEP5 EQEPI (CLB 5)
	CLB_LOCAL_IN_MUX_EQEP6_EQEPI		 = 42,	//!EQEP6 EQEPI (CLB 6)
	CLB_LOCAL_IN_MUX_EPWM11B_OE		 = 43,	//!EPWM11B trip output (CLB 1-4)
	CLB_LOCAL_IN_MUX_EQEP5_EQEPS		 = 43,	//!EQEP5 EQEPS (CLB 5)
	CLB_LOCAL_IN_MUX_EQEP6_EQEPS		 = 43,	//!EQEP6 EQEPS (CLB 6)
	CLB_LOCAL_IN_MUX_EPWM12A		 = 44,	//!EPWM12A (CLB 1-4)
	CLB_LOCAL_IN_MUX_EPWM16A		 = 44,	//!EPWM16A (CLB 5-6)
	CLB_LOCAL_IN_MUX_EPWM12A_OE		 = 45,	//!EPWM12A trip output (CLB 1-4)
	CLB_LOCAL_IN_MUX_EPWM16A_OE		 = 45,	//!EPWM16A trip output (CLB 5-6)
	CLB_LOCAL_IN_MUX_EPWM12B		 = 46,	//!EPWM12B (CLB 1-4)
	CLB_LOCAL_IN_MUX_EPWM16B		 = 46,	//!EPWM16B (CLB 5-6)
	CLB_LOCAL_IN_MUX_EPWM12B_OE		 = 47,	//!EPWM12B trip output (CLB 1-4)
	CLB_LOCAL_IN_MUX_EPWM16B_OE		 = 47,	//!EPWM16B trip output (CLB 5-6)
	CLB_LOCAL_IN_MUX_INPUT17		 = 48,	//!INPUTXBAR INPUT17
	CLB_LOCAL_IN_MUX_INPUT18		 = 49,	//!INPUTXBAR INPUT18
	CLB_LOCAL_IN_MUX_INPUT19		 = 50,	//!INPUTXBAR INPUT19
	CLB_LOCAL_IN_MUX_INPUT20		 = 51,	//!INPUTXBAR INPUT20
	CLB_LOCAL_IN_MUX_INPUT21		 = 52,	//!INPUTXBAR INPUT21
	CLB_LOCAL_IN_MUX_INPUT22		 = 53,	//!INPUTXBAR INPUT22
	CLB_LOCAL_IN_MUX_INPUT23		 = 54,	//!INPUTXBAR INPUT23
	CLB_LOCAL_IN_MUX_INPUT24		 = 55,	//!INPUTXBAR INPUT24
	CLB_LOCAL_IN_MUX_INPUT25		 = 56,	//!INPUTXBAR INPUT25
	CLB_LOCAL_IN_MUX_INPUT26		 = 57,	//!INPUTXBAR INPUT26
	CLB_LOCAL_IN_MUX_INPUT27		 = 58,	//!INPUTXBAR INPUT27
	CLB_LOCAL_IN_MUX_INPUT28		 = 59,	//!INPUTXBAR INPUT28
	CLB_LOCAL_IN_MUX_INPUT29		 = 60,	//!INPUTXBAR INPUT29
	CLB_LOCAL_IN_MUX_INPUT30		 = 61,	//!INPUTXBAR INPUT30
	CLB_LOCAL_IN_MUX_INPUT31		 = 62,	//!INPUTXBAR INPUT31
	CLB_LOCAL_IN_MUX_INPUT32		 = 63	//!INPUTXBAR INPUT32
} CLB_LocalInputMux;

