TexasInstruments/f29h85x-sdk/source/driverlib/clb.h
//*****************************************************************************
//
//! Values that can be passed to CLB_configGlobalInputMux() as the
//! \e globalMuxCfg parameter.
//
//*****************************************************************************
typedef enum
{
	CLB_GLOBAL_IN_MUX_EPWM1A		 = 0,	//!EPWM1A (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM5A		 = 0,	//!EPWM5A (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM1A_OE		 = 1,	//!EPWM1A trip output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM5A_OE		 = 1,	//!EPWM5A trip output (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM1B		 = 2,	//!EPWM1B (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM5B		 = 2,	//!EPWM5B (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM1B_OE		 = 3,	//!EPWM1B trip output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM5B_OE		 = 3,	//!EPWM5B trip output (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM1_CTR_ZERO		 = 4,	//!EPWM1 TBCTR = Zero (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM5_CTR_ZERO		 = 4,	//!EPWM5 TBCTR = Zero (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM1_CTR_PRD		 = 5,	//!EPWM1 TBCTR = TBPRD (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM5_CTR_PRD		 = 5,	//!EPWM5 TBCTR = TBPRD (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM1_CTRDIR		 = 6,	//!EPWM1 CTRDIR (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM5_CTRDIR		 = 6,	//!EPWM5 CTRDIR (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM1_TBCLK		 = 7,	//!EPWM1 TBCLK (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM5_TBCLK		 = 7,	//!EPWM5 TBCLK (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM1_CTR_CMPA		 = 8,	//!EPWM1 TBCTR = CMPA (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM5_CTR_CMPA		 = 8,	//!EPWM5 TBCTR = CMPA (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM1_CTR_CMPB		 = 9,	//!EPWM1 TBCTR = CMPB (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM5_CTR_CMPB		 = 9,	//!EPWM5 TBCTR = CMPB (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM1_CTR_CMPC		 = 10,	//!EPWM1 TBCTR = CMPC (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM5_CTR_CMPC		 = 10,	//!EPWM5 TBCTR = CMPC (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM1_CTR_CMPD		 = 11,	//!EPWM1 TBCTR = CMPD (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM5_CTR_CMPD		 = 11,	//!EPWM5 TBCTR = CMPD (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM1A_AQ		 = 12,	//!EPWM1A AQ submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM5A_AQ		 = 12,	//!EPWM5A AQ submodule output (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM1B_AQ		 = 13,	//!EPWM1B AQ submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM5B_AQ		 = 13,	//!EPWM5B AQ submodule output (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM1A_DB		 = 14,	//!EPWM1A DB submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM5A_DB		 = 14,	//!EPWM5A DB submodule output (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM1B_DB		 = 15,	//!EPWM1B DB submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM5B_DB		 = 15,	//!EPWM5B DB submodule output (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM2A		 = 16,	//!EPWM2A (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM6A		 = 16,	//!EPWM6A (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM2A_OE		 = 17,	//!EPWM2A trip output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM6A_OE		 = 17,	//!EPWM6A trip output (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM2B		 = 18,	//!EPWM2B (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM6B		 = 18,	//!EPWM6B (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM2B_OE		 = 19,	//!EPWM2B trip output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM6B_OE		 = 19,	//!EPWM6B trip output (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM2_CTR_ZERO		 = 20,	//!EPWM2 TBCTR = Zero (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM6_CTR_ZERO		 = 20,	//!EPWM6 TBCTR = Zero (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM2_CTR_PRD		 = 21,	//!EPWM2 TBCTR = TBPRD (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM6_CTR_PRD		 = 21,	//!EPWM6 TBCTR = TBPRD (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM2_CTRDIR		 = 22,	//!EPWM2 CTRDIR (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM6_CTRDIR		 = 22,	//!EPWM6 CTRDIR (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM2_TBCLK		 = 23,	//!EPWM2 TBCLK (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM6_TBCLK		 = 23,	//!EPWM6 TBCLK (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM2_CTR_CMPA		 = 24,	//!EPWM2 TBCTR = CMPA (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM6_CTR_CMPA		 = 24,	//!EPWM6 TBCTR = CMPA (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM2_CTR_CMPB		 = 25,	//!EPWM2 TBCTR = CMPB (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM6_CTR_CMPB		 = 25,	//!EPWM6 TBCTR = CMPB (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM2_CTR_CMPC		 = 26,	//!EPWM2 TBCTR = CMPC (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM6_CTR_CMPC		 = 26,	//!EPWM6 TBCTR = CMPC (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM2_CTR_CMPD		 = 27,	//!EPWM2 TBCTR = CMPD (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM6_CTR_CMPD		 = 27,	//!EPWM6 TBCTR = CMPD (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM2A_AQ		 = 28,	//!EPWM2A AQ submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM6A_AQ		 = 28,	//!EPWM6A AQ submodule output (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM2B_AQ		 = 29,	//!EPWM2B AQ submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM6B_AQ		 = 29,	//!EPWM6B AQ submodule output (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM2A_DB		 = 30,	//!EPWM2A DB submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM6A_DB		 = 30,	//!EPWM6A DB submodule output (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM2B_DB		 = 31,	//!EPWM2B DB submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM6B_DB		 = 31,	//!EPWM6B DB submodule output (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM3A		 = 32,	//!EPWM3A (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM7A		 = 32,	//!EPWM7A (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM3A_OE		 = 33,	//!EPWM3A trip output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM7A_OE		 = 33,	//!EPWM7A trip output (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM3B		 = 34,	//!EPWM3B (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM7B		 = 34,	//!EPWM7B (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM3B_OE		 = 35,	//!EPWM3B trip output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM7B_OE		 = 35,	//!EPWM7B trip output (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM3_CTR_ZERO		 = 36,	//!EPWM3 TBCTR = Zero (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM7_CTR_ZERO		 = 36,	//!EPWM7 TBCTR = Zero (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM3_CTR_PRD		 = 37,	//!EPWM3 TBCTR = TBPRD (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM7_CTR_PRD		 = 37,	//!EPWM7 TBCTR = TBPRD (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM3_CTRDIR		 = 38,	//!EPWM3 CTRDIR (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM7_CTRDIR		 = 38,	//!EPWM7 CTRDIR (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM3_TBCLK		 = 39,	//!EPWM3 TBCLK (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM7_TBCLK		 = 39,	//!EPWM7 TBCLK (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM3_CTR_CMPA		 = 40,	//!EPWM3 TBCTR = CMPA (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM7_CTR_CMPA		 = 40,	//!EPWM7 TBCTR = CMPA (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM3_CTR_CMPB		 = 41,	//!EPWM3 TBCTR = CMPB (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM7_CTR_CMPB		 = 41,	//!EPWM7 TBCTR = CMPB (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM3_CTR_CMPC		 = 42,	//!EPWM3 TBCTR = CMPC (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM7_CTR_CMPC		 = 42,	//!EPWM7 TBCTR = CMPC (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM3_CTR_CMPD		 = 43,	//!EPWM3 TBCTR = CMPD (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM7_CTR_CMPD		 = 43,	//!EPWM7 TBCTR = CMPD (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM3A_AQ		 = 44,	//!EPWM3A AQ submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM7A_AQ		 = 44,	//!EPWM7A AQ submodule output (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM3B_AQ		 = 45,	//!EPWM3B AQ submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM7B_AQ		 = 45,	//!EPWM7B AQ submodule output (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM3A_DB		 = 46,	//!EPWM3A DB submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM7A_DB		 = 46,	//!EPWM7A DB submodule output (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM3B_DB		 = 47,	//!EPWM3B DB submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM7B_DB		 = 47,	//!EPWM7B DB submodule output (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM4A		 = 48,	//!EPWM4A (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM8A		 = 48,	//!EPWM8A (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM4A_OE		 = 49,	//!EPWM4A trip output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM8A_OE		 = 49,	//!EPWM8A trip output (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM4B		 = 50,	//!EPWM4B (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM8B		 = 50,	//!EPWM8B (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM4B_OE		 = 51,	//!EPWM4B trip output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM8B_OE		 = 51,	//!EPWM8B trip output (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM4_CTR_ZERO		 = 52,	//!EPWM4 TBCTR = Zero (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM8_CTR_ZERO		 = 52,	//!EPWM8 TBCTR = Zero (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM4_CTR_PRD		 = 53,	//!EPWM4 TBCTR = TBPRD (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM8_CTR_PRD		 = 53,	//!EPWM8 TBCTR = TBPRD (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM4_CTRDIR		 = 54,	//!EPWM4 CTRDIR (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM8_CTRDIR		 = 54,	//!EPWM8 CTRDIR (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM4_TBCLK		 = 55,	//!EPWM4 TBCLK (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM8_TBCLK		 = 55,	//!EPWM8 TBCLK (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM4_CTR_CMPA		 = 56,	//!EPWM4 TBCTR = CMPA (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM8_CTR_CMPA		 = 56,	//!EPWM8 TBCTR = CMPA (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM4_CTR_CMPB		 = 57,	//!EPWM4 TBCTR = CMPB (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM8_CTR_CMPB		 = 57,	//!EPWM8 TBCTR = CMPB (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM4_CTR_CMPC		 = 58,	//!EPWM4 TBCTR = CMPC (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM8_CTR_CMPC		 = 58,	//!EPWM8 TBCTR = CMPC (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM4_CTR_CMPD		 = 59,	//!EPWM4 TBCTR = CMPD (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM8_CTR_CMPD		 = 59,	//!EPWM8 TBCTR = CMPD (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM4A_AQ		 = 60,	//!EPWM4A AQ submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM8A_AQ		 = 60,	//!EPWM8A AQ submodule output (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM4B_AQ		 = 61,	//!EPWM4B AQ submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM8B_AQ		 = 61,	//!EPWM8B AQ submodule output (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM4A_DB		 = 62,	//!EPWM4A DB submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM8A_DB		 = 62,	//!EPWM8A DB submodule output (CLB 5-6)
	CLB_GLOBAL_IN_MUX_EPWM4B_DB		 = 63,	//!EPWM4B DB submodule output (CLB 1-4)
	CLB_GLOBAL_IN_MUX_EPWM8B_DB		 = 63,	//!EPWM8B DB submodule output (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CLB_AUXSIG0		 = 64,	//!CLB X-BAR AUXSIG0
	CLB_GLOBAL_IN_MUX_CLB_AUXSIG1		 = 65,	//!CLB X-BAR AUXSIG1
	CLB_GLOBAL_IN_MUX_CLB_AUXSIG2		 = 66,	//!CLB X-BAR AUXSIG2
	CLB_GLOBAL_IN_MUX_CLB_AUXSIG3		 = 67,	//!CLB X-BAR AUXSIG3
	CLB_GLOBAL_IN_MUX_CLB_AUXSIG4		 = 68,	//!CLB X-BAR AUXSIG4
	CLB_GLOBAL_IN_MUX_CLB_AUXSIG5		 = 69,	//!CLB X-BAR AUXSIG5
	CLB_GLOBAL_IN_MUX_CLB_AUXSIG6		 = 70,	//!CLB X-BAR AUXSIG6
	CLB_GLOBAL_IN_MUX_CLB_AUXSIG7		 = 71,	//!CLB X-BAR AUXSIG7
	CLB_GLOBAL_IN_MUX_CLB1_OUT16		 = 72,	//!CLB1 OUT16 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB5_OUT16		 = 72,	//!CLB5 OUT16 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CLB1_OUT17		 = 73,	//!CLB1 OUT17 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB5_OUT17		 = 73,	//!CLB5 OUT17 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CLB1_OUT18		 = 74,	//!CLB1 OUT18 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB5_OUT18		 = 74,	//!CLB5 OUT18 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CLB1_OUT19		 = 75,	//!CLB1 OUT19 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB5_OUT19		 = 75,	//!CLB5 OUT19 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CLB1_OUT20		 = 76,	//!CLB1 OUT20 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB5_OUT20		 = 76,	//!CLB5 OUT20 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CLB1_OUT21		 = 77,	//!CLB1 OUT21 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB5_OUT21		 = 77,	//!CLB5 OUT21 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CLB1_OUT22		 = 78,	//!CLB1 OUT22 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB5_OUT22		 = 78,	//!CLB5 OUT22 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CLB1_OUT23		 = 79,	//!CLB1 OUT23 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB5_OUT23		 = 79,	//!CLB5 OUT23 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CLB2_OUT16		 = 80,	//!CLB2 OUT16 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB6_OUT16		 = 80,	//!CLB6 OUT16 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CLB2_OUT17		 = 81,	//!CLB2 OUT17 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB6_OUT17		 = 81,	//!CLB6 OUT17 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CLB2_OUT18		 = 82,	//!CLB2 OUT18 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB6_OUT18		 = 82,	//!CLB6 OUT18 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CLB2_OUT19		 = 83,	//!CLB2 OUT19 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB6_OUT19		 = 83,	//!CLB6 OUT19 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CLB2_OUT20		 = 84,	//!CLB2 OUT20 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB6_OUT20		 = 84,	//!CLB6 OUT20 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CLB2_OUT21		 = 85,	//!CLB2 OUT21 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB6_OUT21		 = 85,	//!CLB6 OUT21 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CLB2_OUT22		 = 86,	//!CLB2 OUT22 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB6_OUT22		 = 86,	//!CLB6 OUT22 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CLB2_OUT23		 = 87,	//!CLB2 OUT23 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB6_OUT23		 = 87,	//!CLB6 OUT23 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CLB3_OUT16		 = 88,	//!CLB3 OUT16 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB3_OUT17		 = 89,	//!CLB3 OUT17 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB3_OUT18		 = 90,	//!CLB3 OUT18 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB3_OUT19		 = 91,	//!CLB3 OUT19 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB3_OUT20		 = 92,	//!CLB3 OUT20 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB3_OUT21		 = 93,	//!CLB3 OUT21 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB3_OUT22		 = 94,	//!CLB3 OUT22 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB3_OUT23		 = 95,	//!CLB3 OUT23 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB4_OUT16		 = 96,	//!CLB4 OUT16 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB4_OUT17		 = 97,	//!CLB4 OUT17 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB4_OUT18		 = 98,	//!CLB4 OUT18 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB4_OUT19		 = 99,	//!CLB4 OUT19 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB4_OUT20		 = 100,	//!CLB4 OUT20 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB4_OUT21		 = 101,	//!CLB4 OUT21 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB4_OUT22		 = 102,	//!CLB4 OUT22 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CLB4_OUT23		 = 103,	//!CLB4 OUT23 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CPU1_ERAD_EVENT0		 = 104,	//!CPU1 ERAD Event 0 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CPU2_ERAD_EVENT0		 = 104,	//!CPU2 ERAD Event 0 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CPU1_ERAD_SEC_EVENT0		 = 104,	//!CPU1 ERAD SEC Event 0 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CPU3_ERAD_EVENT0		 = 104,	//!CPU3 ERAD Event 0 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CPU1_ERAD_EVENT1		 = 105,	//!CPU1 ERAD Event 1 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CPU2_ERAD_EVENT1		 = 105,	//!CPU2 ERAD Event 1 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CPU1_ERAD_SEC_EVENT1		 = 105,	//!CPU1 ERAD SEC Event 1 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CPU3_ERAD_EVENT1		 = 105,	//!CPU3 ERAD Event 1 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CPU1_ERAD_EVENT2		 = 106,	//!CPU1 ERAD Event 2 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CPU2_ERAD_EVENT2		 = 106,	//!CPU2 ERAD Event 2 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CPU1_ERAD_SEC_EVENT2		 = 106,	//!CPU1 ERAD SEC Event 2 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CPU3_ERAD_EVENT2		 = 106,	//!CPU3 ERAD Event 2 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CPU1_ERAD_EVENT3		 = 107,	//!CPU1 ERAD Event 3 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CPU2_ERAD_EVENT3		 = 107,	//!CPU2 ERAD Event 3 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CPU1_ERAD_SEC_EVENT3		 = 107,	//!CPU1 ERAD SEC Event 3 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CPU3_ERAD_EVENT3		 = 107,	//!CPU3 ERAD Event 3 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CPU1_ERAD_EVENT4		 = 108,	//!CPU1 ERAD Event 4 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CPU2_ERAD_EVENT4		 = 108,	//!CPU2 ERAD Event 4 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CPU2_ERAD_SEC_EVENT0		 = 108,	//!CPU2 ERAD SEC Event 0 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CPU3_ERAD_EVENT4		 = 108,	//!CPU3 ERAD Event 4 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CPU3_ERAD_SEC_EVENT0		 = 108,	//!CPU3 ERAD SEC Event 0 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CPU1_ERAD_EVENT5		 = 109,	//!CPU1 ERAD Event 5 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CPU2_ERAD_EVENT5		 = 109,	//!CPU2 ERAD Event 5 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CPU2_ERAD_SEC_EVENT1		 = 109,	//!CPU2 ERAD SEC Event 1 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CPU3_ERAD_EVENT5		 = 109,	//!CPU3 ERAD Event 5 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CPU3_ERAD_SEC_EVENT1		 = 109,	//!CPU3 ERAD SEC Event 1 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CPU1_ERAD_EVENT6		 = 110,	//!CPU1 ERAD Event 6 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CPU2_ERAD_EVENT6		 = 110,	//!CPU2 ERAD Event 6 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CPU2_ERAD_SEC_EVENT2		 = 110,	//!CPU2 ERAD SEC Event 2 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CPU3_ERAD_EVENT6		 = 110,	//!CPU3 ERAD Event 6 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CPU3_ERAD_SEC_EVENT2		 = 110,	//!CPU3 ERAD SEC Event 2 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CPU1_ERAD_EVENT7		 = 111,	//!CPU1 ERAD Event 7 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CPU2_ERAD_EVENT7		 = 111,	//!CPU2 ERAD Event 7 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CPU2_ERAD_SEC_EVENT3		 = 111,	//!CPU2 ERAD SEC Event 3 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CPU3_ERAD_EVENT7		 = 111,	//!CPU3 ERAD Event 7 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_CPU3_ERAD_SEC_EVENT3		 = 111,	//!CPU3 ERAD SEC Event 3 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_FSIRXA_DATA_PACKET_RCVD		 = 112,	//!FSIRXA Data Packet Received (CLB 1-4)
	CLB_GLOBAL_IN_MUX_FSIRXA_PING_TAG_MATCH2		 = 112,	//!FSIRXA PING TAG Match2 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_FSIRXA_ERROR_PACKET_RCVD		 = 113,	//!FSIRXA Error Packet Received (CLB 1-4)
	CLB_GLOBAL_IN_MUX_FSIRXA_CLB5_CLB6_DATA_TAG_MATCH2		 = 113,	//!FSIRXA DATA TAG Match2 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_FSIRXA_PING_PACKET_RCVD		 = 114,	//!FSIRXA PING Packet Received (CLB 1-4)
	CLB_GLOBAL_IN_MUX_FSIRXA_ERROR_TAG_MATCH2		 = 114,	//!FSIRXA ERROR TAG Match2 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_FSIRXA_OUTPUT_FRAME_DONE		 = 115,	//!FSIRXA Output Frame Done (CLB 1-4)
	CLB_GLOBAL_IN_MUX_FSIRXB_PING_TAG_MATCH		 = 115,	//!FSIRXB PING TAG Match (CLB 5-6)
	CLB_GLOBAL_IN_MUX_FSIRXA_PING_TAG_MATCH1		 = 116,	//!FSIRXA PING TAG Match2 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_FSIRXB_DATA_TAG_MATCH		 = 116,	//!FSIRXB DATA TAG Match (CLB 5-6)
	CLB_GLOBAL_IN_MUX_FSIRXA_CLB1_CLB4_DATA_TAG_MATCH2		 = 117,	//!FSIRXA DATA TAG Match2 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_FSIRXB_ERROR_TAG_MATCH		 = 117,	//!FSIRXB ERROR TAG Match (CLB 5-6)
	CLB_GLOBAL_IN_MUX_FSIRXA_ERROR_TAG_MATCH1		 = 118,	//!FSIRXA ERROR TAG Match2 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_ECAT_SOF		 = 118,	//!ECAT Start of Frame (CLB 5-6)
	CLB_GLOBAL_IN_MUX_FSIRXA_RX_TRIG2		 = 119,	//!FSIRXA RX Trig 2 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_ECAT_EOF		 = 119,	//!ECAT End of Frame (CLB 5-6)
	CLB_GLOBAL_IN_MUX_SPI1_SPICLK		 = 120,	//!SPI1 SPICLK OUT (CLB 1-4)
	CLB_GLOBAL_IN_MUX_SPI1_SPIPOCI_CONTROLLER		 = 121,	//!SPI1 SPIPOCI Controller IN (CLB 1-4)
	CLB_GLOBAL_IN_MUX_SPI1_SPIPTE		 = 122,	//!SPI1 SPIPTE OUT (CLB 1-4)
	CLB_GLOBAL_IN_MUX_SPI2_SPICLK		 = 123,	//!SPI2 SPICLK OUT (CLB 1-4)
	CLB_GLOBAL_IN_MUX_SPI2_SPIPOCI_CONTROLLER		 = 124,	//!SPI2 SPIPOCI Controller IN (CLB 1-4)
	CLB_GLOBAL_IN_MUX_SPI2_SPIPTE		 = 125,	//!SPI2 SPIPTE OUT (CLB 1-4)
	CLB_GLOBAL_IN_MUX_CPU3_HALT		 = 126,	//!CPU3 HALT (CLB 1-4)
	CLB_GLOBAL_IN_MUX_ECAT_SYNC0		 = 126,	//!ECAT Sync 0 (CLB 5-6)
	CLB_GLOBAL_IN_MUX_FSIRXA_RX_TRIG3		 = 127,	//!FSIRXA RX Trig 3 (CLB 1-4)
	CLB_GLOBAL_IN_MUX_ECAT_SYNC1		 = 127	//!ECAT Sync 1 (CLB 5-6)
} CLB_GlobalInputMux;

//*****************************************************************************
//
// Prototypes for the APIs.
//
//*****************************************************************************
//
//!
//! Checks the CLB base address.
//!
//! \param base is the base address of a CLB tile's logic config register.
//!
//! This function determines if a CLB base address is valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static inline bool CLB_isBaseValid(uint32_t base)
{
    return(
           ((base & BASE_ADDR_MASK) == CLB1_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == CLB2_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == CLB3_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == CLB4_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == CLB5_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == CLB6_BASE_FRAME(0U))
          );
}

//*****************************************************************************
//
//!
//! Checks the CLB internal memory address.
//!
//! \param base is the base address of a CLB tile's logic config register.
//!
//! This function determines if a CLB base address is valid.
//!
//! \return Returns \b true if the address is valid and \b false otherwise.
//
//*****************************************************************************
static inline bool CLB_isAddressValid(uint32_t address)
{
    return(address <= (CLB_ADDR_HLC_BASE + CLB_NUM_HLC_INSTR));
}
#endif

//*****************************************************************************
//
//! Set global enable.
//!
//! \param base is the base address of a CLB tile's logic config register.
//!
//! This function enables the CLB via global enable register.
//!
//! \return None.
//
//*****************************************************************************
static inline void CLB_enableCLB(uint32_t base)
{
    ASSERT(CLB_isBaseValid(base));

    HWREGH(base + CLB_LOGICCTL + CLB_O_LOAD_EN) |= CLB_LOAD_EN_GLOBAL_EN; 
}

//*****************************************************************************
//
//! Clear global enable.
//!
//! \param base is the base address of a CLB tile's logic config register.
//!
//! This function disables the CLB via global enable register.
//!
//! \return None.
//
//*****************************************************************************
static inline void CLB_disableCLB(uint32_t base)
{
    ASSERT(CLB_isBaseValid(base));

